Revit API Introduction Labs
LabUtils.GetSingleSelectedElementOrPrompt Method ()
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public static Element GetSingleSelectedElementOrPrompt(
	UIDocument uidoc
)
Visual Basic (Declaration)
Public Shared Function GetSingleSelectedElementOrPrompt ( _
	uidoc As UIDocument _
) As Element
Visual C++
public:
static Element^ GetSingleSelectedElementOrPrompt(
	UIDocument^ uidoc
)
Parameters
uidoc
Type: UIDocument
See Also
LabUtils Class
GetSingleSelectedElementOrPrompt Overload
Labs Namespace